### Terraform Plan for `prod`

| Check | Status |
|-------|--------|
| Format | `failure` |
| Init | `success` |
| Validate | `success` |
| Plan | `success` |

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
google_service_account.vm: Refreshing state... [id=projects/job-match-v0/serviceAccounts/jobmatch-vm-sa@job-match-v0.iam.gserviceaccount.com]
google_service_account.terraform: Refreshing state... [id=projects/job-match-v0/serviceAccounts/terraform-sa@job-match-v0.iam.gserviceaccount.com]
google_project_service.apis["iamcredentials.googleapis.com"]: Refreshing state... [id=job-match-v0/iamcredentials.googleapis.com]
data.google_compute_zones.available: Reading...
google_service_account.deploy: Refreshing state... [id=projects/job-match-v0/serviceAccounts/deploy-sa@job-match-v0.iam.gserviceaccount.com]
google_project_service.apis["aiplatform.googleapis.com"]: Refreshing state... [id=job-match-v0/aiplatform.googleapis.com]
google_project_service.secretmanager: Refreshing state... [id=job-match-v0/secretmanager.googleapis.com]
google_project_service.apis["iam.googleapis.com"]: Refreshing state... [id=job-match-v0/iam.googleapis.com]
data.google_project.current: Reading...
google_project_service.apis["bigquery.googleapis.com"]: Refreshing state... [id=job-match-v0/bigquery.googleapis.com]
data.google_compute_zones.available: Read complete after 0s [id=projects/job-match-v0/regions/europe-west1]
google_project_service.apis["storage.googleapis.com"]: Refreshing state... [id=job-match-v0/storage.googleapis.com]
google_project_service.apis["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=job-match-v0/cloudresourcemanager.googleapis.com]
google_project_service.apis["compute.googleapis.com"]: Refreshing state... [id=job-match-v0/compute.googleapis.com]
data.google_project.current: Read complete after 0s [id=projects/job-match-v0]
google_secret_manager_secret.postgres_password: Refreshing state... [id=projects/job-match-v0/secrets/postgres-password]
google_secret_manager_secret.django_secret_key: Refreshing state... [id=projects/job-match-v0/secrets/django-secret-key]
google_iam_workload_identity_pool.github: Refreshing state... [id=projects/job-match-v0/locations/global/workloadIdentityPools/github-pool]
google_compute_address.static: Refreshing state... [id=projects/job-match-v0/regions/europe-west1/addresses/jobmatch-static-ip]
google_secret_manager_secret.bigquery_gold_sa_key: Refreshing state... [id=projects/job-match-v0/secrets/bigquery-gold-sa-key]
google_compute_network.main: Refreshing state... [id=projects/job-match-v0/global/networks/jobmatch-vpc]
google_bigquery_dataset.silver: Refreshing state... [id=projects/job-match-v0/datasets/jobmatch_silver]
google_bigquery_dataset.gold: Refreshing state... [id=projects/job-match-v0/datasets/jobmatch_gold]
google_iam_workload_identity_pool_provider.github: Refreshing state... [id=projects/job-match-v0/locations/global/workloadIdentityPools/github-pool/providers/github-provider]
google_compute_firewall.allow_ssh: Refreshing state... [id=projects/job-match-v0/global/firewalls/jobmatch-vpc-allow-ssh]
google_compute_firewall.allow_http: Refreshing state... [id=projects/job-match-v0/global/firewalls/jobmatch-vpc-allow-http]
google_compute_firewall.allow_internal: Refreshing state... [id=projects/job-match-v0/global/firewalls/jobmatch-vpc-allow-internal]
google_compute_subnetwork.main: Refreshing state... [id=projects/job-match-v0/regions/europe-west1/subnetworks/jobmatch-subnet]
google_compute_firewall.allow_icmp: Refreshing state... [id=projects/job-match-v0/global/firewalls/jobmatch-vpc-allow-icmp]
google_compute_firewall.allow_https: Refreshing state... [id=projects/job-match-v0/global/firewalls/jobmatch-vpc-allow-https]
google_compute_instance.main: Refreshing state... [id=projects/job-match-v0/zones/europe-west1-b/instances/jobmatch-vm]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_bigquery_dataset.gold will be updated in-place
  ~ resource "google_bigquery_dataset" "gold" {
      ~ delete_contents_on_destroy      = false -> true
        id                              = "projects/job-match-v0/datasets/jobmatch_gold"
      ~ labels                          = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
      ~ terraform_labels                = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
        # (14 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # google_bigquery_dataset.silver will be updated in-place
  ~ resource "google_bigquery_dataset" "silver" {
      ~ delete_contents_on_destroy      = false -> true
        id                              = "projects/job-match-v0/datasets/jobmatch_silver"
      ~ labels                          = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
      ~ terraform_labels                = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
        # (14 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # google_bigquery_dataset_iam_member.vm_gold_editor will be created
  + resource "google_bigquery_dataset_iam_member" "vm_gold_editor" {
      + dataset_id = "jobmatch_gold"
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "serviceAccount:jobmatch-vm-sa@job-match-v0.iam.gserviceaccount.com"
      + project    = "job-match-v0"
      + role       = "roles/bigquery.dataEditor"
    }

  # google_bigquery_dataset_iam_member.vm_silver_editor will be created
  + resource "google_bigquery_dataset_iam_member" "vm_silver_editor" {
      + dataset_id = "jobmatch_silver"
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "serviceAccount:jobmatch-vm-sa@job-match-v0.iam.gserviceaccount.com"
      + project    = "job-match-v0"
      + role       = "roles/bigquery.dataEditor"
    }

  # google_bigquery_table.offer_formations will be created
  + resource "google_bigquery_table" "offer_formations" {
      + allow_resource_tags_on_deletion = false
      + creation_time                   = (known after apply)
      + dataset_id                      = "jobmatch_silver"
      + deletion_protection             = false
      + description                     = "Required formations per offer"
      + effective_labels                = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
      + etag                            = (known after apply)
      + expiration_time                 = (known after apply)
      + id                              = (known after apply)
      + labels                          = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
      + last_modified_time              = (known after apply)
      + location                        = (known after apply)
      + num_bytes                       = (known after apply)
      + num_long_term_bytes             = (known after apply)
      + num_rows                        = (known after apply)
      + project                         = "job-match-v0"
      + schema                          = jsonencode(
            [
              + {
                  + description = "Foreign key to offers"
                  + mode        = "REQUIRED"
                  + name        = "offer_id"
                  + type        = "STRING"
                },
              + {
                  + description = "Formation code"
                  + mode        = "NULLABLE"
                  + name        = "formation_code"
                  + type        = "STRING"
                },
              + {
                  + description = "Formation label"
                  + mode        = "NULLABLE"
                  + name        = "formation_libelle"
                  + type        = "STRING"
                },
              + {
                  + description = "Education level"
                  + mode        = "NULLABLE"
                  + name        = "formation_niveau"
                  + type        = "STRING"
                },
              + {
                  + description = "Requirement level"
                  + mode        = "NULLABLE"
                  + name        = "formation_exigence"
                  + type        = "STRING"
                },
            ]
        )
      + self_link                       = (known after apply)
      + table_id                        = "offer_formations"
      + terraform_labels                = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
      + type                            = (known after apply)
    }

  # google_bigquery_table.offer_languages will be created
  + resource "google_bigquery_table" "offer_languages" {
      + allow_resource_tags_on_deletion = false
      + creation_time                   = (known after apply)
      + dataset_id                      = "jobmatch_silver"
      + deletion_protection             = false
      + description                     = "Required languages per offer"
      + effective_labels                = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
      + etag                            = (known after apply)
      + expiration_time                 = (known after apply)
      + id                              = (known after apply)
      + labels                          = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
      + last_modified_time              = (known after apply)
      + location                        = (known after apply)
      + num_bytes                       = (known after apply)
      + num_long_term_bytes             = (known after apply)
      + num_rows                        = (known after apply)
      + project                         = "job-match-v0"
      + schema                          = jsonencode(
            [
              + {
                  + description = "Foreign key to offers"
                  + mode        = "REQUIRED"
                  + name        = "offer_id"
                  + type        = "STRING"
                },
              + {
                  + description = "Language code"
                  + mode        = "NULLABLE"
                  + name        = "langue_code"
                  + type        = "STRING"
                },
              + {
                  + description = "Language label"
                  + mode        = "NULLABLE"
                  + name        = "langue_libelle"
                  + type        = "STRING"
                },
              + {
                  + description = "Language level"
                  + mode        = "NULLABLE"
                  + name        = "langue_niveau"
                  + type        = "STRING"
                },
              + {
                  + description = "Requirement level"
                  + mode        = "NULLABLE"
                  + name        = "langue_exigence"
                  + type        = "STRING"
                },
            ]
        )
      + self_link                       = (known after apply)
      + table_id                        = "offer_languages"
      + terraform_labels                = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
      + type                            = (known after apply)
    }

  # google_bigquery_table.offer_skills will be created
  + resource "google_bigquery_table" "offer_skills" {
      + allow_resource_tags_on_deletion = false
      + creation_time                   = (known after apply)
      + dataset_id                      = "jobmatch_silver"
      + deletion_protection             = false
      + description                     = "Required skills per offer"
      + effective_labels                = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
      + etag                            = (known after apply)
      + expiration_time                 = (known after apply)
      + id                              = (known after apply)
      + labels                          = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
      + last_modified_time              = (known after apply)
      + location                        = (known after apply)
      + num_bytes                       = (known after apply)
      + num_long_term_bytes             = (known after apply)
      + num_rows                        = (known after apply)
      + project                         = "job-match-v0"
      + schema                          = jsonencode(
            [
              + {
                  + description = "Foreign key to offers"
                  + mode        = "REQUIRED"
                  + name        = "offer_id"
                  + type        = "STRING"
                },
              + {
                  + description = "Skill code"
                  + mode        = "NULLABLE"
                  + name        = "skill_code"
                  + type        = "STRING"
                },
              + {
                  + description = "Skill label"
                  + mode        = "NULLABLE"
                  + name        = "skill_libelle"
                  + type        = "STRING"
                },
              + {
                  + description = "Requirement level (E/S)"
                  + mode        = "NULLABLE"
                  + name        = "skill_exigence"
                  + type        = "STRING"
                },
            ]
        )
      + self_link                       = (known after apply)
      + table_id                        = "offer_skills"
      + terraform_labels                = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
      + type                            = (known after apply)
    }

  # google_bigquery_table.offers will be created
  + resource "google_bigquery_table" "offers" {
      + allow_resource_tags_on_deletion = false
      + creation_time                   = (known after apply)
      + dataset_id                      = "jobmatch_silver"
      + deletion_protection             = false
      + description                     = "Main job offers table"
      + effective_labels                = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
      + etag                            = (known after apply)
      + expiration_time                 = (known after apply)
      + id                              = (known after apply)
      + labels                          = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
      + last_modified_time              = (known after apply)
      + location                        = (known after apply)
      + num_bytes                       = (known after apply)
      + num_long_term_bytes             = (known after apply)
      + num_rows                        = (known after apply)
      + project                         = "job-match-v0"
      + schema                          = jsonencode(
            [
              + {
                  + description = "Offer ID"
                  + mode        = "REQUIRED"
                  + name        = "id"
                  + type        = "STRING"
                },
              + {
                  + description = "Job title"
                  + mode        = "NULLABLE"
                  + name        = "intitule"
                  + type        = "STRING"
                },
              + {
                  + description = "Job description"
                  + mode        = "NULLABLE"
                  + name        = "description"
                  + type        = "STRING"
                },
              + {
                  + description = "Creation date"
                  + mode        = "NULLABLE"
                  + name        = "date_creation"
                  + type        = "TIMESTAMP"
                },
              + {
                  + description = "Last update date"
                  + mode        = "NULLABLE"
                  + name        = "date_actualisation"
                  + type        = "TIMESTAMP"
                },
              + {
                  + description = "Work location"
                  + mode        = "NULLABLE"
                  + name        = "lieu_travail_libelle"
                  + type        = "STRING"
                },
              + {
                  + description = "Postal code"
                  + mode        = "NULLABLE"
                  + name        = "lieu_travail_code_postal"
                  + type        = "STRING"
                },
              + {
                  + description = "Company name"
                  + mode        = "NULLABLE"
                  + name        = "entreprise_nom"
                  + type        = "STRING"
                },
              + {
                  + description = "Contract type"
                  + mode        = "NULLABLE"
                  + name        = "type_contrat"
                  + type        = "STRING"
                },
              + {
                  + description = "Contract type label"
                  + mode        = "NULLABLE"
                  + name        = "type_contrat_libelle"
                  + type        = "STRING"
                },
              + {
                  + description = "Contract nature"
                  + mode        = "NULLABLE"
                  + name        = "nature_contrat"
                  + type        = "STRING"
                },
              + {
                  + description = "Required experience"
                  + mode        = "NULLABLE"
                  + name        = "experience_exige"
                  + type        = "STRING"
                },
              + {
                  + description = "Experience label"
                  + mode        = "NULLABLE"
                  + name        = "experience_libelle"
                  + type        = "STRING"
                },
              + {
                  + description = "Salary label"
                  + mode        = "NULLABLE"
                  + name        = "salaire_libelle"
                  + type        = "STRING"
                },
              + {
                  + description = "Minimum salary"
                  + mode        = "NULLABLE"
                  + name        = "salaire_min"
                  + type        = "FLOAT64"
                },
              + {
                  + description = "Maximum salary"
                  + mode        = "NULLABLE"
                  + name        = "salaire_max"
                  + type        = "FLOAT64"
                },
              + {
                  + description = "Work duration"
                  + mode        = "NULLABLE"
                  + name        = "duree_travail_libelle"
                  + type        = "STRING"
                },
              + {
                  + description = "ROME code"
                  + mode        = "NULLABLE"
                  + name        = "code_rome"
                  + type        = "STRING"
                },
              + {
                  + description = "ROME label"
                  + mode        = "NULLABLE"
                  + name        = "libelle_rome"
                  + type        = "STRING"
                },
              + {
                  + description = "Business sector"
                  + mode        = "NULLABLE"
                  + name        = "secteur_activite"
                  + type        = "STRING"
                },
              + {
                  + description = "Qualification code"
                  + mode        = "NULLABLE"
                  + name        = "qualification_code"
                  + type        = "STRING"
                },
              + {
                  + description = "Qualification label"
                  + mode        = "NULLABLE"
                  + name        = "qualification_libelle"
                  + type        = "STRING"
                },
              + {
                  + description = "Offer source"
                  + mode        = "NULLABLE"
                  + name        = "origine_offre"
                  + type        = "STRING"
                },
              + {
                  + description = "Original URL"
                  + mode        = "NULLABLE"
                  + name        = "url_origine"
                  + type        = "STRING"
                },
              + {
                  + description = "Ingestion timestamp"
                  + mode        = "NULLABLE"
                  + name        = "ingestion_date"
                  + type        = "TIMESTAMP"
                },
              + {
                  + description = "Source file name"
                  + mode        = "NULLABLE"
                  + name        = "source_file"
                  + type        = "STRING"
                },
            ]
        )
      + self_link                       = (known after apply)
      + table_id                        = "offers"
      + terraform_labels                = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
      + type                            = (known after apply)
    }

  # google_bigquery_table.offers_daily_stats will be created
  + resource "google_bigquery_table" "offers_daily_stats" {
      + allow_resource_tags_on_deletion = false
      + creation_time                   = (known after apply)
      + dataset_id                      = "jobmatch_gold"
      + deletion_protection             = false
      + description                     = "Daily offer statistics"
      + effective_labels                = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
      + etag                            = (known after apply)
      + expiration_time                 = (known after apply)
      + id                              = (known after apply)
      + labels                          = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
      + last_modified_time              = (known after apply)
      + location                        = (known after apply)
      + num_bytes                       = (known after apply)
      + num_long_term_bytes             = (known after apply)
      + num_rows                        = (known after apply)
      + project                         = "job-match-v0"
      + schema                          = jsonencode(
            [
              + {
                  + description = "Statistics date"
                  + mode        = "REQUIRED"
                  + name        = "date"
                  + type        = "DATE"
                },
              + {
                  + description = "Total offers count"
                  + mode        = "NULLABLE"
                  + name        = "total_offers"
                  + type        = "INT64"
                },
              + {
                  + description = "New offers today"
                  + mode        = "NULLABLE"
                  + name        = "new_offers"
                  + type        = "INT64"
                },
              + {
                  + description = "CDI offers count"
                  + mode        = "NULLABLE"
                  + name        = "cdi_count"
                  + type        = "INT64"
                },
              + {
                  + description = "CDD offers count"
                  + mode        = "NULLABLE"
                  + name        = "cdd_count"
                  + type        = "INT64"
                },
              + {
                  + description = "Interim offers count"
                  + mode        = "NULLABLE"
                  + name        = "interim_count"
                  + type        = "INT64"
                },
              + {
                  + description = "Average min salary"
                  + mode        = "NULLABLE"
                  + name        = "avg_salary_min"
                  + type        = "FLOAT64"
                },
              + {
                  + description = "Average max salary"
                  + mode        = "NULLABLE"
                  + name        = "avg_salary_max"
                  + type        = "FLOAT64"
                },
            ]
        )
      + self_link                       = (known after apply)
      + table_id                        = "offers_daily_stats"
      + terraform_labels                = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
      + type                            = (known after apply)
    }

  # google_bigquery_table.skills_ranking will be created
  + resource "google_bigquery_table" "skills_ranking" {
      + allow_resource_tags_on_deletion = false
      + creation_time                   = (known after apply)
      + dataset_id                      = "jobmatch_gold"
      + deletion_protection             = false
      + description                     = "Most requested skills ranking"
      + effective_labels                = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
      + etag                            = (known after apply)
      + expiration_time                 = (known after apply)
      + id                              = (known after apply)
      + labels                          = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
      + last_modified_time              = (known after apply)
      + location                        = (known after apply)
      + num_bytes                       = (known after apply)
      + num_long_term_bytes             = (known after apply)
      + num_rows                        = (known after apply)
      + project                         = "job-match-v0"
      + schema                          = jsonencode(
            [
              + {
                  + description = "Ranking date"
                  + mode        = "REQUIRED"
                  + name        = "date"
                  + type        = "DATE"
                },
              + {
                  + description = "Skill code"
                  + mode        = "NULLABLE"
                  + name        = "skill_code"
                  + type        = "STRING"
                },
              + {
                  + description = "Skill label"
                  + mode        = "NULLABLE"
                  + name        = "skill_libelle"
                  + type        = "STRING"
                },
              + {
                  + description = "Number of offers"
                  + mode        = "NULLABLE"
                  + name        = "offer_count"
                  + type        = "INT64"
                },
              + {
                  + description = "Ranking position"
                  + mode        = "NULLABLE"
                  + name        = "rank"
                  + type        = "INT64"
                },
            ]
        )
      + self_link                       = (known after apply)
      + table_id                        = "skills_ranking"
      + terraform_labels                = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
      + type                            = (known after apply)
    }

  # google_compute_instance.main must be replaced
-/+ resource "google_compute_instance" "main" {
      + allow_stopping_for_update = true
      ~ cpu_platform              = "Intel Broadwell" -> (known after apply)
      ~ current_status            = "RUNNING" -> (known after apply)
      - enable_display            = false -> null
      ~ guest_accelerator         = [] -> (known after apply)
      ~ id                        = "projects/job-match-v0/zones/europe-west1-b/instances/jobmatch-vm" -> (known after apply)
      ~ instance_id               = "7507558173129465978" -> (known after apply)
      ~ label_fingerprint         = "4gdcAoucCFs=" -> (known after apply)
      ~ labels                    = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
      ~ metadata                  = {
          - "startup-script" = <<-EOT
                #!/bin/bash
                set -e
                
                # Log startup script output
                exec > >(tee /var/log/startup-script.log) 2>&1
                echo "Starting startup script at $(date)"
                
                # Update system
                apt-get update
                apt-get upgrade -y
                
                # Install Docker
                apt-get install -y ca-certificates curl gnupg jq
                install -m 0755 -d /etc/apt/keyrings
                curl -fsSL https://download.docker.com/linux/ubuntu/gpg | gpg --dearmor -o /etc/apt/keyrings/docker.gpg
                chmod a+r /etc/apt/keyrings/docker.gpg
                
                echo                   "deb [arch=$(dpkg --print-architecture) signed-by=/etc/apt/keyrings/docker.gpg] https://download.docker.com/linux/ubuntu                   $(. /etc/os-release && echo "$VERSION_CODENAME") stable" |                   tee /etc/apt/sources.list.d/docker.list > /dev/null
                
                apt-get update
                apt-get install -y docker-ce docker-ce-cli containerd.io docker-buildx-plugin docker-compose-plugin
                
                # Start Docker
                systemctl enable docker
                systemctl start docker
                
                # Install Caddy
                apt-get install -y debian-keyring debian-archive-keyring apt-transport-https
                curl -1sLf 'https://dl.cloudsmith.io/public/caddy/stable/gpg.key' | gpg --dearmor -o /usr/share/keyrings/caddy-stable-archive-keyring.gpg
                curl -1sLf 'https://dl.cloudsmith.io/public/caddy/stable/debian.deb.txt' | tee /etc/apt/sources.list.d/caddy-stable.list
                apt-get update
                apt-get install -y caddy
                
                # Install Git
                apt-get install -y git
                
                # Create app directories
                mkdir -p /opt/jobmatch
                mkdir -p /opt/jobmatch/secrets
                chown -R 1000:1000 /opt/jobmatch
                
                # Create Caddy config placeholder
                cat > /etc/caddy/Caddyfile <<'CADDYFILE'
                # JobMatch Caddyfile
                # Replace :80 with your domain for automatic HTTPS
                
                :80 {
                    reverse_proxy localhost:8085
                }
                CADDYFILE
                
                # Reload Caddy
                systemctl reload caddy
                
                # Clone the repository (public repo, no auth needed)
                echo "Cloning repository..."
                cd /opt/jobmatch
                if [ ! -d ".git" ]; then
                  git clone https://github.com/MatthieuEngles/jobmatch.git .
                fi
                chown -R 1000:1000 /opt/jobmatch
                
                # Create script to fetch secrets from Secret Manager
                cat > /opt/jobmatch/fetch-secrets.sh <<'FETCHSCRIPT'
                #!/bin/bash
                set -e
                
                PROJECT_ID="job-match-v0"
                SECRETS_DIR="/opt/jobmatch/secrets"
                ENV_FILE="/opt/jobmatch/.env"
                
                echo "Fetching secrets from GCP Secret Manager..."
                
                # Fetch secrets using gcloud (VM has access via service account)
                POSTGRES_PASSWORD=$(gcloud secrets versions access latest --secret="postgres-password" --project="$PROJECT_ID" 2>/dev/null || echo "")
                DJANGO_SECRET_KEY=$(gcloud secrets versions access latest --secret="django-secret-key" --project="$PROJECT_ID" 2>/dev/null || echo "")
                
                # Fetch BigQuery Gold SA key and save to file
                gcloud secrets versions access latest --secret="bigquery-gold-sa-key" --project="$PROJECT_ID" > "$SECRETS_DIR/bigquery-gold-key.json" 2>/dev/null || echo "{}" > "$SECRETS_DIR/bigquery-gold-key.json"
                chmod 600 "$SECRETS_DIR/bigquery-gold-key.json"
                
                # Create .env file for docker-compose
                cat > "$ENV_FILE" <<ENVFILE
                # Auto-generated from GCP Secret Manager
                POSTGRES_PASSWORD=$POSTGRES_PASSWORD
                DJANGO_SECRET_KEY=$DJANGO_SECRET_KEY
                
                # GCP Configuration (for Vertex AI - no API key needed, uses ADC)
                GCP_PROJECT_ID=job-match-v0
                GCP_LOCATION=europe-west1
                
                # BigQuery Gold cross-project access
                BIGQUERY_GOLD_PROJECT_ID=jobmatch-482415
                BIGQUERY_GOLD_CROSS_PROJECT_DATASET=jobmatch_gold
                
                # LLM Configuration (Vertex AI Gemini)
                LLM_MODEL=gemini-1.5-flash-002
                LLM_MAX_TOKENS=4096
                
                # Embeddings
                EMBEDDINGS_PROVIDER=sentence-transformers
                EMBEDDINGS_MODEL=paraphrase-multilingual-MiniLM-L12-v2
                ENVFILE
                
                chmod 600 "$ENV_FILE"
                echo "Secrets fetched successfully."
                FETCHSCRIPT
                chmod +x /opt/jobmatch/fetch-secrets.sh
                
                # Create deploy script
                cat > /opt/jobmatch/deploy.sh <<'DEPLOYSCRIPT'
                #!/bin/bash
                set -e
                
                cd /opt/jobmatch
                
                # Fetch latest secrets
                ./fetch-secrets.sh
                
                # Pull latest code (if git repo exists)
                if [ -d ".git" ]; then
                    git pull origin main
                fi
                
                # Build and start services
                docker compose -f docker-compose.prod.yml build
                docker compose -f docker-compose.prod.yml up -d
                
                echo "Deployment completed at $(date)"
                DEPLOYSCRIPT
                chmod +x /opt/jobmatch/deploy.sh
                
                echo "Startup script completed at $(date)"
            EOT -> null
            # (1 unchanged element hidden)
        }
      ~ metadata_fingerprint      = "R4q2ThNJZ5A=" -> (known after apply)
      + metadata_startup_script   = <<-EOT # forces replacement
            #!/bin/bash
                set -e
            
                # Log startup script output
                exec > >(tee /var/log/startup-script.log) 2>&1
                echo "Starting startup script at $(date)"
            
                # Update system
                apt-get update
                apt-get upgrade -y
            
                # Install Docker
                apt-get install -y ca-certificates curl gnupg jq
                install -m 0755 -d /etc/apt/keyrings
                curl -fsSL https://download.docker.com/linux/ubuntu/gpg | gpg --dearmor -o /etc/apt/keyrings/docker.gpg
                chmod a+r /etc/apt/keyrings/docker.gpg
            
                echo                   "deb [arch=$(dpkg --print-architecture) signed-by=/etc/apt/keyrings/docker.gpg] https://download.docker.com/linux/ubuntu                   $(. /etc/os-release && echo "$VERSION_CODENAME") stable" |                   tee /etc/apt/sources.list.d/docker.list > /dev/null
            
                apt-get update
                apt-get install -y docker-ce docker-ce-cli containerd.io docker-buildx-plugin docker-compose-plugin
            
                # Start Docker
                systemctl enable docker
                systemctl start docker
            
                # Install Caddy
                apt-get install -y debian-keyring debian-archive-keyring apt-transport-https
                curl -1sLf 'https://dl.cloudsmith.io/public/caddy/stable/gpg.key' | gpg --dearmor -o /usr/share/keyrings/caddy-stable-archive-keyring.gpg
                curl -1sLf 'https://dl.cloudsmith.io/public/caddy/stable/debian.deb.txt' | tee /etc/apt/sources.list.d/caddy-stable.list
                apt-get update
                apt-get install -y caddy
            
                # Install Git
                apt-get install -y git
            
                # Create app directories
                mkdir -p /opt/jobmatch
                mkdir -p /opt/jobmatch/secrets
                chown -R 1000:1000 /opt/jobmatch
            
                # Create Caddy config with domain support
                DOMAIN=""
            
                if [ -n "$DOMAIN" ] && [ "$DOMAIN" != "" ]; then
                  # Domain configured - enable HTTPS with automatic certificate
                  cat > /etc/caddy/Caddyfile <<CADDYFILE
            # JobMatch Caddyfile with HTTPS
            
            # Main domain with automatic HTTPS
            $DOMAIN {
                reverse_proxy localhost:8085
                encode gzip
            
                header {
                    # Security headers
                    X-Content-Type-Options nosniff
                    X-Frame-Options DENY
                    Referrer-Policy strict-origin-when-cross-origin
                }
            }
            
            # Also allow access via IP on port 80 (no HTTPS)
            :80 {
                reverse_proxy localhost:8085
            }
            CADDYFILE
                else
                  # No domain - HTTP only
                  cat > /etc/caddy/Caddyfile <<'CADDYFILE'
            # JobMatch Caddyfile (HTTP only - no domain configured)
            
            :80 {
                reverse_proxy localhost:8085
            }
            CADDYFILE
                fi
            
                # Reload Caddy
                systemctl reload caddy
            
                # Clone the repository (public repo, no auth needed)
                echo "Cloning repository..."
                cd /opt/jobmatch
                if [ ! -d ".git" ]; then
                  git clone https://github.com/MatthieuEngles/jobmatch.git .
                fi
                chown -R 1000:1000 /opt/jobmatch
            
                # Create script to fetch secrets from Secret Manager
                cat > /opt/jobmatch/fetch-secrets.sh <<'FETCHSCRIPT'
                #!/bin/bash
                set -e
            
                PROJECT_ID="job-match-v0"
                SECRETS_DIR="/opt/jobmatch/secrets"
                ENV_FILE="/opt/jobmatch/.env"
            
                echo "Fetching secrets from GCP Secret Manager..."
            
                # Fetch secrets using gcloud (VM has access via service account)
                POSTGRES_PASSWORD=$(gcloud secrets versions access latest --secret="postgres-password" --project="$PROJECT_ID" 2>/dev/null || echo "")
                DJANGO_SECRET_KEY=$(gcloud secrets versions access latest --secret="django-secret-key" --project="$PROJECT_ID" 2>/dev/null || echo "")
            
                # Fetch BigQuery Gold SA key and save to file
                gcloud secrets versions access latest --secret="bigquery-gold-sa-key" --project="$PROJECT_ID" > "$SECRETS_DIR/bigquery-gold-key.json" 2>/dev/null || echo "{}" > "$SECRETS_DIR/bigquery-gold-key.json"
                chmod 600 "$SECRETS_DIR/bigquery-gold-key.json"
            
                # Create .env file for docker-compose
                cat > "$ENV_FILE" <<ENVFILE
                # Auto-generated from GCP Secret Manager
                POSTGRES_PASSWORD=$POSTGRES_PASSWORD
                DJANGO_SECRET_KEY=$DJANGO_SECRET_KEY
            
                # GCP Configuration (for Vertex AI - no API key needed, uses ADC)
                GCP_PROJECT_ID=job-match-v0
                GCP_LOCATION=europe-west1
            
                # BigQuery Gold cross-project access
                BIGQUERY_GOLD_PROJECT_ID=jobmatch-482415
                BIGQUERY_GOLD_CROSS_PROJECT_DATASET=jobmatch_gold
            
                # LLM Configuration (Vertex AI Gemini)
                LLM_MODEL=gemini-1.5-flash-002
                LLM_MAX_TOKENS=4096
            
                # Embeddings
                EMBEDDINGS_PROVIDER=sentence-transformers
                EMBEDDINGS_MODEL=paraphrase-multilingual-MiniLM-L12-v2
            
                # Domain configuration (for CSRF/CORS)
                DOMAIN=
                ENVFILE
            
                chmod 600 "$ENV_FILE"
                echo "Secrets fetched successfully."
                FETCHSCRIPT
                chmod +x /opt/jobmatch/fetch-secrets.sh
            
                # Create deploy script
                cat > /opt/jobmatch/deploy.sh <<'DEPLOYSCRIPT'
                #!/bin/bash
                set -e
            
                cd /opt/jobmatch
            
                # Fetch latest secrets
                ./fetch-secrets.sh
            
                # Pull latest code (if git repo exists)
                if [ -d ".git" ]; then
                    git pull origin main
                fi
            
                # Build and start services
                docker compose -f docker-compose.prod.yml build
                docker compose -f docker-compose.prod.yml up -d
            
                echo "Deployment completed at $(date)"
                DEPLOYSCRIPT
                chmod +x /opt/jobmatch/deploy.sh
            
                echo "Startup script completed at $(date)"
        EOT
      + min_cpu_platform          = (known after apply)
        name                      = "jobmatch-vm"
      - resource_policies         = [] -> null
      ~ self_link                 = "https://www.googleapis.com/compute/v1/projects/job-match-v0/zones/europe-west1-b/instances/jobmatch-vm" -> (known after apply)
        tags                      = [
            "http-server",
            "https-server",
            "ssh",
        ]
      ~ tags_fingerprint          = "xEi19su0rvw=" -> (known after apply)
      ~ terraform_labels          = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
        # (6 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/job-match-v0/zones/europe-west1-b/disks/jobmatch-vm" -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ initialize_params {
              - enable_confidential_compute = false -> null
              ~ image                       = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-2204-jammy-v20251218" -> "ubuntu-os-cloud/ubuntu-2204-lts"
              ~ labels                      = {} -> (known after apply)
              ~ provisioned_iops            = 0 -> (known after apply)
              ~ provisioned_throughput      = 0 -> (known after apply)
              - resource_manager_tags       = {} -> null
                # (2 unchanged attributes hidden)
            }
        }

      ~ network_interface {
          ~ internal_ipv6_prefix_length = 0 -> (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          ~ name                        = "nic0" -> (known after apply)
          ~ network                     = "https://www.googleapis.com/compute/v1/projects/job-match-v0/global/networks/jobmatch-vpc" -> (known after apply)
          ~ network_ip                  = "10.0.0.2" -> (known after apply)
          - queue_count                 = 0 -> null
          ~ stack_type                  = "IPV4_ONLY" -> (known after apply)
          ~ subnetwork                  = "https://www.googleapis.com/compute/v1/projects/job-match-v0/regions/europe-west1/subnetworks/jobmatch-subnet" -> "projects/job-match-v0/regions/europe-west1/subnetworks/jobmatch-subnet"
          ~ subnetwork_project          = "job-match-v0" -> (known after apply)

            # (1 unchanged block hidden)
        }

      - scheduling {
          - automatic_restart   = true -> null
          - min_node_cpus       = 0 -> null
          - on_host_maintenance = "MIGRATE" -> null
          - preemptible         = false -> null
          - provisioning_model  = "STANDARD" -> null
        }

      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }

        # (1 unchanged block hidden)
    }

  # google_project_iam_member.deploy_compute_admin will be created
  + resource "google_project_iam_member" "deploy_compute_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:deploy-sa@job-match-v0.iam.gserviceaccount.com"
      + project = "job-match-v0"
      + role    = "roles/compute.instanceAdmin.v1"
    }

  # google_project_iam_member.deploy_compute_viewer will be created
  + resource "google_project_iam_member" "deploy_compute_viewer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:deploy-sa@job-match-v0.iam.gserviceaccount.com"
      + project = "job-match-v0"
      + role    = "roles/compute.viewer"
    }

  # google_project_iam_member.deploy_iap_tunnel will be created
  + resource "google_project_iam_member" "deploy_iap_tunnel" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:deploy-sa@job-match-v0.iam.gserviceaccount.com"
      + project = "job-match-v0"
      + role    = "roles/iap.tunnelResourceAccessor"
    }

  # google_project_iam_member.deploy_os_admin_login will be created
  + resource "google_project_iam_member" "deploy_os_admin_login" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:deploy-sa@job-match-v0.iam.gserviceaccount.com"
      + project = "job-match-v0"
      + role    = "roles/compute.osAdminLogin"
    }

  # google_project_iam_member.deploy_os_login will be created
  + resource "google_project_iam_member" "deploy_os_login" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:deploy-sa@job-match-v0.iam.gserviceaccount.com"
      + project = "job-match-v0"
      + role    = "roles/compute.osLogin"
    }

  # google_project_iam_member.terraform_editor will be created
  + resource "google_project_iam_member" "terraform_editor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:terraform-sa@job-match-v0.iam.gserviceaccount.com"
      + project = "job-match-v0"
      + role    = "roles/editor"
    }

  # google_project_iam_member.terraform_sa_user will be created
  + resource "google_project_iam_member" "terraform_sa_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:terraform-sa@job-match-v0.iam.gserviceaccount.com"
      + project = "job-match-v0"
      + role    = "roles/iam.serviceAccountUser"
    }

  # google_project_iam_member.terraform_storage_admin will be created
  + resource "google_project_iam_member" "terraform_storage_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:terraform-sa@job-match-v0.iam.gserviceaccount.com"
      + project = "job-match-v0"
      + role    = "roles/storage.admin"
    }

  # google_project_iam_member.vm_bigquery_job_user will be created
  + resource "google_project_iam_member" "vm_bigquery_job_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:jobmatch-vm-sa@job-match-v0.iam.gserviceaccount.com"
      + project = "job-match-v0"
      + role    = "roles/bigquery.jobUser"
    }

  # google_project_iam_member.vm_logging_writer will be created
  + resource "google_project_iam_member" "vm_logging_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:jobmatch-vm-sa@job-match-v0.iam.gserviceaccount.com"
      + project = "job-match-v0"
      + role    = "roles/logging.logWriter"
    }

  # google_project_iam_member.vm_monitoring_writer will be created
  + resource "google_project_iam_member" "vm_monitoring_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:jobmatch-vm-sa@job-match-v0.iam.gserviceaccount.com"
      + project = "job-match-v0"
      + role    = "roles/monitoring.metricWriter"
    }

  # google_project_iam_member.vm_vertexai_user will be created
  + resource "google_project_iam_member" "vm_vertexai_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:jobmatch-vm-sa@job-match-v0.iam.gserviceaccount.com"
      + project = "job-match-v0"
      + role    = "roles/aiplatform.user"
    }

  # google_secret_manager_secret.bigquery_gold_sa_key will be updated in-place
  ~ resource "google_secret_manager_secret" "bigquery_gold_sa_key" {
        id                    = "projects/job-match-v0/secrets/bigquery-gold-sa-key"
      ~ labels                = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
        name                  = "projects/323309663680/secrets/bigquery-gold-sa-key"
      ~ terraform_labels      = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_secret_manager_secret.django_secret_key will be updated in-place
  ~ resource "google_secret_manager_secret" "django_secret_key" {
        id                    = "projects/job-match-v0/secrets/django-secret-key"
      ~ labels                = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
        name                  = "projects/323309663680/secrets/django-secret-key"
      ~ terraform_labels      = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_secret_manager_secret.postgres_password will be updated in-place
  ~ resource "google_secret_manager_secret" "postgres_password" {
        id                    = "projects/job-match-v0/secrets/postgres-password"
      ~ labels                = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
        name                  = "projects/323309663680/secrets/postgres-password"
      ~ terraform_labels      = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_secret_manager_secret_iam_member.vm_bigquery_gold_sa_key will be created
  + resource "google_secret_manager_secret_iam_member" "vm_bigquery_gold_sa_key" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:jobmatch-vm-sa@job-match-v0.iam.gserviceaccount.com"
      + project   = "job-match-v0"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "bigquery-gold-sa-key"
    }

  # google_secret_manager_secret_iam_member.vm_django_secret will be created
  + resource "google_secret_manager_secret_iam_member" "vm_django_secret" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:jobmatch-vm-sa@job-match-v0.iam.gserviceaccount.com"
      + project   = "job-match-v0"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "django-secret-key"
    }

  # google_secret_manager_secret_iam_member.vm_postgres_password will be created
  + resource "google_secret_manager_secret_iam_member" "vm_postgres_password" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:jobmatch-vm-sa@job-match-v0.iam.gserviceaccount.com"
      + project   = "job-match-v0"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "postgres-password"
    }

  # google_service_account_iam_member.deploy_workload_identity will be created
  + resource "google_service_account_iam_member" "deploy_workload_identity" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "principalSet://iam.googleapis.com/projects/323309663680/locations/global/workloadIdentityPools/github-pool/attribute.repository/MatthieuEngles/jobmatch"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = "projects/job-match-v0/serviceAccounts/deploy-sa@job-match-v0.iam.gserviceaccount.com"
    }

  # google_service_account_iam_member.terraform_workload_identity will be created
  + resource "google_service_account_iam_member" "terraform_workload_identity" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "principalSet://iam.googleapis.com/projects/323309663680/locations/global/workloadIdentityPools/github-pool/attribute.repository/MatthieuEngles/jobmatch"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = "projects/job-match-v0/serviceAccounts/terraform-sa@job-match-v0.iam.gserviceaccount.com"
    }

  # google_storage_bucket.backups will be created
  + resource "google_storage_bucket" "backups" {
      + effective_labels            = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
      + location                    = "EUROPE-WEST1"
      + name                        = "jobmatch-backups-job-match-v0"
      + project                     = "job-match-v0"
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + storage_class = "NEARLINE"
              + type          = "SetStorageClass"
            }
          + condition {
              + age                   = 7
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + send_age_if_zero      = true
              + with_state            = (known after apply)
            }
        }
      + lifecycle_rule {
          + action {
              + storage_class = "COLDLINE"
              + type          = "SetStorageClass"
            }
          + condition {
              + age                   = 30
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + send_age_if_zero      = true
              + with_state            = (known after apply)
            }
        }
      + lifecycle_rule {
          + action {
              + type = "Delete"
            }
          + condition {
              + age                   = 90
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + send_age_if_zero      = true
              + with_state            = (known after apply)
            }
        }

      + versioning {
          + enabled = true
        }
    }

  # google_storage_bucket.bronze will be created
  + resource "google_storage_bucket" "bronze" {
      + effective_labels            = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
      + location                    = "EUROPE-WEST1"
      + name                        = "jobmatch-bronze-job-match-v0"
      + project                     = "job-match-v0"
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "jobmatch"
        }
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + storage_class = "NEARLINE"
              + type          = "SetStorageClass"
            }
          + condition {
              + age                   = 90
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + send_age_if_zero      = true
              + with_state            = (known after apply)
            }
        }
      + lifecycle_rule {
          + action {
              + storage_class = "COLDLINE"
              + type          = "SetStorageClass"
            }
          + condition {
              + age                   = 365
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + send_age_if_zero      = true
              + with_state            = (known after apply)
            }
        }
      + lifecycle_rule {
          + action {
              + type = "Delete"
            }
          + condition {
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + num_newer_versions    = 3
              + send_age_if_zero      = true
              + with_state            = "ARCHIVED"
            }
        }

      + versioning {
          + enabled = true
        }
    }

  # google_storage_bucket_iam_member.vm_backups_admin will be created
  + resource "google_storage_bucket_iam_member" "vm_backups_admin" {
      + bucket = "jobmatch-backups-job-match-v0"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:jobmatch-vm-sa@job-match-v0.iam.gserviceaccount.com"
      + role   = "roles/storage.objectAdmin"
    }

  # google_storage_bucket_iam_member.vm_bronze_admin will be created
  + resource "google_storage_bucket_iam_member" "vm_bronze_admin" {
      + bucket = "jobmatch-bronze-job-match-v0"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:jobmatch-vm-sa@job-match-v0.iam.gserviceaccount.com"
      + role   = "roles/storage.objectAdmin"
    }

Plan: 30 to add, 5 to change, 1 to destroy.

Changes to Outputs:
  + backups_bucket_name             = "jobmatch-backups-job-match-v0"
  + bronze_bucket_name              = "jobmatch-bronze-job-match-v0"
  + bronze_bucket_url               = (known after apply)
  + summary                         = <<-EOT
        ============================================================
        JobMatch V0 - Deployment Summary
        ============================================================
        
        VM Instance:
          Name:        jobmatch-vm
          External IP: 35.189.200.57
          Zone:        europe-west1-b
        
        SSH Command:
          gcloud compute ssh jobmatch-vm --zone=europe-west1-b --project=job-match-v0
        
        Storage:
          Bronze Bucket: jobmatch-bronze-job-match-v0
          Backups Bucket: jobmatch-backups-job-match-v0
        
        BigQuery:
          Silver Dataset: jobmatch_silver
          Gold Dataset:   jobmatch_gold
        
        GitHub Actions Variables (set in repo settings):
          GCP_PROJECT_ID:                  job-match-v0
          GCP_WORKLOAD_IDENTITY_PROVIDER:  projects/323309663680/locations/global/workloadIdentityPools/github-pool/providers/github-provider
          GCP_DEPLOY_SERVICE_ACCOUNT:      deploy-sa@job-match-v0.iam.gserviceaccount.com
          VM_NAME:                         jobmatch-vm
        
        Next Steps:
          1. Add secrets to GCP Secret Manager:
             - postgres-password
             - django-secret-key
             - bigquery-gold-sa-key (JSON key file content)
          2. Set GitHub repository variables (above)
          3. Push to main branch to trigger deployment
        
        ============================================================
    EOT
  ~ vm_internal_ip                  = "10.0.0.2" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Triggered by: @MatthieuEngles*